In [17]:
import pandas as pd

In [18]:
titanic = pd.read_excel("titanic3.xls", "titanic3", index_col=None, na_value=["NA"])

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
titanic.describe()

In [ ]:
titanic.shape

In [ ]:
titanic['name']

In [ ]:
tit = titanic[['name','age']]

In [ ]:
tit.head()

In [ ]:
titanic.loc[5:10,['name','age']]

In [ ]:
titanic[titanic['age']>20].sort_values('age').head()

In [ ]:
titanic['fare_2018']=titanic['fare']*26.62

In [ ]:
titanic[['name','age','fare','fare_2018']].sort_values('fare',ascending=False).head()

In [ ]:
titanic['age'].isnull().sum()

In [ ]:
average_age = titanic['age'].mean()
titanic['corrected_age']=titanic['age'].fillna(average_age)
titanic['corrected_age'].isnull().sum()

In [ ]:
titanic['sex'].value_counts()

In [ ]:
titanic.groupby('sex')['survived'].sum()

In [ ]:
# titanic.to_excel('new_titanic_data.xls')

In [19]:
titanic.groupby(["sex", "pclass"]).mean()

               survived        age     sibsp     parch        fare        body
sex    pclass
female 1       0.965278  37.037594  0.555556  0.472222  109.412385         NaN
       2       0.886792  27.499191  0.500000  0.650943   23.234827   52.000000
       3       0.490741  22.185307  0.791667  0.731481   15.324250  183.000000
male   1       0.340782  41.029250  0.340782  0.279330   69.888385  162.828571
       2       0.146199  30.815401  0.327485  0.192982   19.904946  171.233333
       3       0.152130  25.962273  0.470588  0.255578   12.415462  151.854167

In [22]:
titanic[titanic["age"]<18].groupby(["sex", "pclass"]).mean()

               survived        age     sibsp     parch        fare   body
sex    pclass
female 1       0.875000  14.125000  0.500000  0.875000  104.083337    NaN
       2       1.000000   8.273150  0.666667  1.166667   27.998844    NaN
       3       0.543478   8.416667  1.456522  1.043478   18.284148  328.0
male   1       0.857143   9.845243  0.571429  1.714286  129.752371    NaN
       2       0.733333   6.222220  0.600000  0.933333   31.750280    NaN
       3       0.233333   9.838888  1.966667  1.016667   21.677570   65.5